app/Controllers/Page.php

    public function home()
    {
        $db = \Config\Database::connect();
        // table users
        $query = $db->table('users')
        ->select('name, role');
        $data['users']=$query->get()->getResult();

        // table inbound
        $queryInbound=$db->table('inbound')
        ->selectSum('qty','total_qty');
        $data['inbound']=$queryInbound->get()->getResult();
---
SELECT `name`, `role`
FROM `users`
SELECT SUM(`qty`) AS `total_qty`
FROM `inbound`

    public function put_away(){
        $db = \Config\Database::connect();
        $query = $db->table('putaway')
        ->select('no_put_away,MAX(putaway.date_processed) as date_process')
        ->select('users.name as processed_by_name, users_approve.name as approve_by_name')
        ->join('users', 'putaway.processed_by = users.id_user')
        ->join('users as users_approve', 'putaway.approve_by = users_approve.id_user')
        ->groupBy('no_put_away');

        $data['details']=$query->get()->getResult();
---
SELECT `no_put_away`, MAX(putaway.date_processed) as date_process, `users`.`name` as `processed_by_name`, `users_approve`.`name` as `approve_by_name`
FROM `putaway`
JOIN `users` ON `putaway`.`processed_by` = `users`.`id_user`
JOIN `users` as `users_approve` ON `putaway`.`approve_by` = `users_approve`.`id_user`
GROUP BY `no_put_away`

    public function scan_inbound()
    {
        // Mengambil semua data inbound
        $db = \Config\Database::connect();
        $query = $db->table('inbound')
            ->select('no_inbound, MAX(inbound.date_process) as date_process')
            ->select('users.name as processed_by_name, users_approve.name as approve_by_name')
            ->join('users', 'inbound.processed_by = users.id_user')
            ->join('users as users_approve', 'inbound.approve_by = users_approve.id_user')
            ->groupBy('no_inbound');

        $data['users'] = $query->get()->getResult();
---
SELECT `no_inbound`, MAX(inbound.date_process) as date_process, `users`.`name` as `processed_by_name`, `users_approve`.`name` as `approve_by_name`
FROM `inbound`
JOIN `users` ON `inbound`.`processed_by` = `users`.`id_user`
JOIN `users` as `users_approve` ON `inbound`.`approve_by` = `users_approve`.`id_user`
GROUP BY `no_inbound`

    public function detail_inbound($no_inbound)
    {
        $db = \Config\Database::connect();

        $query = $db->table('inbound')
            ->select('*')
            ->where('no_inbound', $no_inbound);

        $data['details'] = $query->get()->getResult();
---
SELECT *
FROM `inbound`
WHERE `no_inbound` = 'INV001'

    public function detail_put_away($no_put_away)
    {
        $db = \Config\Database::connect();

        $query = $db->table('putaway')
            ->select('inbound.sku, inbound.qty, inbound.brand, inbound.article, putaway.binlock')
            ->join('inbound', 'putaway.processed_by = inbound.processed_by', 'right')
            ->where('no_put_away', $no_put_away);

            $data['details'] = $query->get()->getResult();
---
SELECT `inbound`.`sku`, `inbound`.`qty`, `inbound`.`brand`, `inbound`.`article`, `putaway`.`binlock`
FROM `putaway`
RIGHT JOIN `inbound` ON `putaway`.`processed_by` = `inbound`.`processed_by`
WHERE `no_put_away` = 'FIL-PUT123'